In [1]:
# Functinal Prgramming
def check_palindrome(word):
    return word

In [4]:
check_palindrome('Ajay')

'Ajay'

In [5]:
a ='Lucky'
a[::-1]

'ykcuL'

In [7]:
a='Lucky'
if a == a[::-1]:
    print(f'{a} is a palindrome')
else:
    print(f'{a} is not a palindrome')

Lucky is not a palindrome

In [11]:
def check_palindrome(word):
    if type(word) == str:
        word = word.upper()
        if word == word[::-1]:
            return 'Palindrome'
        else:
            return 'Not a Palindrome'
    else:
        print('Invalid Data Type')
check_palindrome('Nitin')

'Plaindrome'

In [12]:
check_plaindrome(123)

Invalid Data Type

In [18]:
print(give_fibo(20))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181]

In [20]:
# check_prime function
def check_prime(number):
    for i in range(2,number):
        if number % i == 0:
            return 'Not a Prime Number'
            break
    else:
        return 'Prime Number'

In [21]:
check_prime(35)

'Not a Prime Number'

In [25]:
check_prime(3)

'Prime Number'

In [35]:
n=5


for i in range(1,n+1):
    print('  '*(n-i) + i*'* ')

        *
      * *
    * * *
  * * * *
* * * * *

In [41]:
def print_star(n = 5, typ = 'left',shape ='*'):
    if typ == 'left':
        space = ''

    elif typ == 'right':
        space = '  '

    elif typ == 'mid':
        space = ' '
        
    for i in range(1,n+1):
        print(space*(n-i) + i*f'{shape}')

In [39]:
print_star(4,'left')

      *
    * *
  * * *
* * * *

In [42]:
print_star(6,'mid','$')

     $
    $$
   $$$
  $$$$
 $$$$$
$$$$$$

In [44]:
# method
def sum_of_n_natural_number(n):
    result = 0
    for i in range(1,n+1):
        result += i
    return result

In [45]:
sum_of_n_natural_number(10)

55

In [46]:
#factorial method
def factorial(n):
    result = 1
    for i in range(1,n+1):
        result *= i
    return result

In [47]:
factorial(6)

720

In [11]:
def total_sales(*args):
    #unpacking
    result = 0
    for i in args:
       result += i
    return result

In [12]:
total_sales(1,2)

3

In [13]:
sales =[45678,72,57,33,54]
min_element = sales[0]

for i in sales[1:]:
    if i < min_element:
        min_element = i
print(min_element)

33

In [17]:
sales =[45678,72,57,33,54]
max_element = sales[0]

for i in sales[1:]:
    if i > max_element:
        max_element = i
print(max_element)

45678

In [24]:
def max(*data):
    max_element = data[0]
    for i in data[1:]:
       if i > max_element:
        max_element = i
    return max_element

In [26]:
max(23,453,345,473)

473

In [27]:
# question company = ['Ola' , 'Uber', 'Rapido' , 'Indrive' , 'Adani' ]

In [28]:
company = ['Ola' , 'Uber', 'Rapido' , 'Indrive' , 'Adani' ]
def add_hastag(company):
    result = []
    for i in company:
        result.append('#' +i.upper())
    return result

In [29]:
add_hastag('ola',x 'uber')

['#OLA', '#UBER']

In [8]:
def store_records(name,age,sec,roll_no,Class):
    data = {'Name':name, 'Age':age,'Sec':sec,'Roll_no.':roll_no,'Class':Class}
    import pandas as pd
    result = pd.DataFrame(data,index = [1])
    return result

In [41]:
display(store_records('Karan', 22 , 'A','12','12'))
display(store_records('Mohan', 24 , 'A','12','12'))
display(store_records('Sohan', 26 , 'A','12','12'))

    Name  Age Sec Roll_no. Class
1  Karan   22   A       12    12

    Name  Age Sec Roll_no. Class
1  Mohan   24   A       12    12

    Name  Age Sec Roll_no. Class
1  Sohan   26   A       12    12